БИТУправление_медицинским_центром_демо/src/Catalogs/СообщенияРЭМД/СообщенияРЭМД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СообщенияРЭМД</name>
  <attributes>
    <name>Документ</name>
    <type>
      <types>DefinedType.ПодписанныйОбъект</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлуЭМД</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправить</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Обновить</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстПоследнейОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>CatalogRef.РегистрируемыеЭлектронныеМедДокументы</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВерсии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторРЭМД</name>
    <comment>emdrId</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХранитьДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторШаблонаЭМД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Транспорт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ЭлектронныеПодписиЭМД</name>
    <attributes>
      <name>ПутьКФайлуПодписиЭМД</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>РольРЭМД</name>
      <type>
        <types>CatalogRef.РолиПриПодписиМедДокументов</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоПодписьМО</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>УИД_ЭЦП</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ДолжностьМинздрава</name>
      <type>
        <types>CatalogRef.КлассификаторыМинЗдрава</types>
      </type>
    </attributes>
    <attributes>
      <name>СпециальностьМинздрава</name>
      <type>
        <types>CatalogRef.КлассификаторыМинЗдрава</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/Enums/СостоянияСообщенийРЭМД/СостоянияСообщенийРЭМД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияСообщенийРЭМД</name>
  <enumValues>
    <name>Зарегистрированные</name>
  </enumValues>
  <enumValues>
    <name>КОтправке</name>
  </enumValues>
  <enumValues>
    <name>СОшибками</name>
  </enumValues>
  <enumValues>
    <name>НеПодписаныМО</name>
  </enumValues>
  <enumValues>
    <name>НеПолученОтвет</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Catalogs/СообщенияРЭМД/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Состояние") Тогда
		
		НачалоДня = Дата(1,1,1);
		ВыбранныйФилиал = Неопределено;
		
		Если Параметры.Свойство("ЗаСегодня") И Параметры.ЗаСегодня Тогда
			НачалоДня = НачалоДня(ТекущаяДатаСеанса());
		КонецЕсли;
		
		Если Параметры.Свойство("Филиал") Тогда
			ВыбранныйФилиал = Параметры.Филиал;
		КонецЕсли;
		
		ИзменитьТекстЗапроса(Параметры.Состояние, НачалоДня, ВыбранныйФилиал);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИзменитьТекстЗапроса(Состояние, НачалоДня, ВыбранныйФилиал)
	
	НовыйТекстЗапроса =
		"ВЫБРАТЬ
		|	СообщенияРЭМД.Ссылка КАК Ссылка,
		|	СообщенияРЭМД.ПометкаУдаления КАК ПометкаУдаления,
		|	СообщенияРЭМД.Код КАК Код,
		|	СообщенияРЭМД.Наименование КАК Наименование,
		|	СообщенияРЭМД.Документ КАК Документ,
		|	СообщенияРЭМД.Клиент КАК Клиент,
		|	СообщенияРЭМД.ДатаСоздания КАК ДатаСоздания,
		|	СообщенияРЭМД.ПутьКФайлуЭМД КАК ПутьКФайлуЭМД,
		|	СообщенияРЭМД.Отправить КАК Отправить,
		|	СообщенияРЭМД.Обновить КАК Обновить,
		|	СообщенияРЭМД.НомерДокумента КАК НомерДокумента,
		|	СообщенияРЭМД.ИдентификаторДокумента КАК ИдентификаторДокумента,
		|	СообщенияРЭМД.ТекстПоследнейОшибки КАК ТекстПоследнейОшибки,
		|	СообщенияРЭМД.ВидДокумента КАК ВидДокумента,
		|	СообщенияРЭМД.НомерВерсии КАК НомерВерсии,
		|	СообщенияРЭМД.ИдентификаторРЭМД КАК ИдентификаторРЭМД,
		|	СообщенияРЭМД.ХранитьДо КАК ХранитьДо,
		|	СообщенияРЭМД.ИдентификаторШаблонаЭМД КАК ИдентификаторШаблонаЭМД,
		|	СообщенияРЭМД.Предопределенный КАК Предопределенный,
		|	СообщенияРЭМД.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных,
		|	СообщенияРЭМД.Документ.Филиал КАК Филиал
		|ИЗ
		|	Справочник.СообщенияРЭМД КАК СообщенияРЭМД
		|ГДЕ
		|	СообщенияРЭМД.Ссылка В
		|			(ВЫБРАТЬ
		|				СообщенияРЭМД.Ссылка
		|			ИЗ
		|				СообщенияПоСостоянию КАК СообщенияРЭМД)";
	
	ТекстыЗапросов = ПолучитьТекстыЗапросовПоСостояниям();
	
	ЧастиТекстаЗапроса = Новый Массив;
	ЧастиТекстаЗапроса.Добавить(ТекстыЗапросов.Получить(Состояние));
	ЧастиТекстаЗапроса.Добавить(НовыйТекстЗапроса);
	
	Список.ТекстЗапроса = СтрСоединить(ЧастиТекстаЗапроса, ";" + Символы.ПС);
	Список.Параметры.УстановитьЗначениеПараметра("НачалоДня", НачалоДня);
	Список.Параметры.УстановитьЗначениеПараметра("ПоВыбранномуФилиалу", ВыбранныйФилиал <> Неопределено);
	Список.Параметры.УстановитьЗначениеПараметра("ВыбранныйФилиал", ВыбранныйФилиал);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТекстыЗапросовПоСостояниям()
	
	ИмяВТ = "СообщенияПоСостоянию";
	
	Тексты = Новый Соответствие;
	Тексты.Вставить(Перечисления.СостоянияСообщенийРЭМД.Зарегистрированные,	ИнтеграцияЕГИСЗ_РЭМД.ТекстЗапросаВТСообщенияЗарегистрированные(ИмяВТ));
	Тексты.Вставить(Перечисления.СостоянияСообщенийРЭМД.КОтправке,			ИнтеграцияЕГИСЗ_РЭМД.ТекстЗапросаВТСообщенияКОтправке(ИмяВТ));
	Тексты.Вставить(Перечисления.СостоянияСообщенийРЭМД.СОшибками,			ИнтеграцияЕГИСЗ_РЭМД.ТекстЗапросаВТСообщенияСОшибками(ИмяВТ));
	Тексты.Вставить(Перечисления.СостоянияСообщенийРЭМД.НеПодписаныМО,		ИнтеграцияЕГИСЗ_РЭМД.ТекстЗапросаВТСообщенияНеПодписаныМО(ИмяВТ));
	Тексты.Вставить(Перечисления.СостоянияСообщенийРЭМД.НеПолученОтвет,		ИнтеграцияЕГИСЗ_РЭМД.ТекстЗапросаВТСообщенияНеПолученОтвет(ИмяВТ));
	
	Возврат Тексты;
	
КонецФункции

#КонецОбласти
